{"link": "https://vi.wikipedia.org/wiki/Wikipedia", "title": "Wikipedia", "paragraphs": ["Wikipedia (/ˌwɪkɪˈpiːdiə/ (nghe) WIK-i-PEE-dee-ə hoặc /ˌwɪkiˈpiːdiə/ (nghe) WIK-ee-PEE-dee-ə) là một bách khoa toàn thư mở với mục đích chính là cho phép mọi người đều có thể viết bài bằng nhiều loại ngôn ngữ trên Internet.[4] Wikipedia đang là công trình tham khảo viết chung lớn nhất và phổ biến nhất trên Internet,[5][6][7][8] và hiện tại được xếp hạng trang web phổ biến thứ 5 trên toàn cầu[9]. Wikipedia thuộc về tổ chức phi lợi nhuận Wikimedia Foundation.[10][11][12]\nDự án này, nói chung, bắt đầu từ ngày 15 tháng 1 năm 2001 để bổ sung bách khoa toàn thư Nupedia bởi những nhà chuyên môn; hiện nay Wikipedia trực thuộc Quỹ Hỗ trợ Wikimedia, một tổ chức phi lợi nhuận. Wikipedia hiện có hơn 15 triệu bài viết, với hơn 5 triệu bài trong phiên bản tiếng Anh (English Wikipedia); vào tháng 1 năm 2006, nó có hơn 750.000 thành viên. Từ khi được mở cửa, Wikipedia càng ngày càng nổi tiếng[13] và sự thành công của nó đã nảy sinh ra vài dự án liên quan. Tuy nhiên, có nhiều tranh luận về sự tin cậy của nó. Mặc dù vậy, một công bố vào ngày 9/8/2014 của viện thăm dò YouGov sau khi khảo sát 2.000 người tại Anh cho thấy 64% số người được hỏi tin vào độ xác thực của thông tin trên Wikipedia, cao hơn tỉ lệ 61% tin vào BBC, và vào những tờ báo uy tín khác như Times (45%), The Guardian (45%), The Sun (13%).\nWikipedia thường được làm nguồn bởi phương tiện truyền thông đại chúng, có khi được chỉ trích và cũng có khi được khen vì những đặc tính:tự do, mở, dễ sửa đổi và phạm vi rộng rãi. Nhiều khi dự án không chỉ được nói đến, nhưng cũng được làm nguồn về chủ đề khác. Wikipedia khuyến khích những người đóng góp theo quy định \"Thái độ trung lập\", bằng cách tóm tắt các quan điểm quan trọng để tới gần sự thật khách quan. Việc dùng Wikipedia như nguồn tham khảo đã gây ra tranh luận vì tính mở của nó làm nó có thể bị phá hoại, bị sửa không đúng, hoặc không bao gồm các chủ đề đều đặn, hoặc có ý kiến không có căn cứ. Nó cũng bị chê là có thiên vị nhất quán, đặt cao ý kiến số đông hơn là bằng cấp, sự thiếu trách nhiệm cũng như kiến thức chuyên môn của người viết khi được so sánh với những bách khoa toàn thư thông thường. Tuy nhiên, sự rộng rãi và cặn kẽ của nó, và tính năng được cập nhật liên tục, đã làm dự án trở thành nguồn tham khảo hữu ích đối với hàng triệu người.\nWikipedia hiện có hơn 290 phiên bản ngôn ngữ, trong đó vào khoảng 280 đang hoạt động. 16 phiên bản đã có hơn 500.000 bài viết: tiếng Anh, Hàn, Thụy Điển, Đức, Hà Lan, Pháp, Waray-Waray, Nga, Ý, Cebu, Tây Ban Nha, Việt, Ba Lan, Nhật, Bồ Đào Nha, Hoa và tiếng Ukraina. Phiên bản tiếng Đức đã được phát hành trên đĩa DVD, và nhiều phiên bản khác được sao chép qua website khác.\nNăm 2005, tập san Nature công bố một đánh giá so sánh 42 bài viết nội dung khoa học từ Encyclopædia Britannica và Wikipedia, cho thấy mức độ chính xác của Wikipedia tiệm cận với mức chính xác của Encyclopædia Britannica.[14]\nWikipedia cũng bị chỉ trích vì đã cho thấy sự thiên lệch có tính hệ thống, đưa ra một sự kết hợp giữa \"sự thật, nửa sự thật, và một số sai lầm\",[15] và trong các chủ đề gây tranh cãi, đã bị chính trị thao túng và bị truyền thông sử dụng để tuyên truyền.[16]\nVào năm 2017, Facebook thông báo rằng nó sẽ giúp người đọc phát hiện tin tức giả mạo bằng các liên kết tương ứng với các bài viết trên Wikipedia. YouTube đã công bố một kế hoạch tương tự vào năm 2018. Đáp lại, The Washington Post đã nhấn mạnh, \"Wikipedia là cảnh sát tốt của Internet\".[17]\nMục lục", "Đặc trưng\nKhẩu hiệu của Wikipedia là \"Bách khoa toàn thư tự do để tất cả mọi người sửa đổi\", và người thành lập dự án Jimmy Wales diễn tả mục đích của nó là \"để tạo ra bách khoa toàn thư miễn phí có phẩm chất càng cao càng tốt và đưa nó cho tất cả mọi người trên thế giới bằng ngôn ngữ họ dùng\"[18]. Nó được viết trên website wikipedia.org dùng một loại phần mềm gọi là \"wiki\", thuật ngữ dùng để gọi WikiWikiWeb trước tiên và bắt nguồn từ tiếng Hawaii Wiki Wiki, tức là \"nhanh lẹ\". Ông Wales có mục đích là dẫn Wikipedia tới phẩm chất \"của Britannica hoặc cao hơn\" và được xuất bản trên giấy.\nVài dự án bách khoa toàn thư đã và đang hoạt động. Vài dự án có quy định cộng tác và sở hữu bài viết theo kiểu truyền thống, ví dụ như Bách khoa toàn thư Triết học Stanford bởi những nhà chuyên môn hoặc dự án Nupedia đã đóng cửa. Những website thoải mái hơn như là h2g2 và Everything2 làm việc dạy chỉ tổng quát, những bài viết ở đấy được viết và quản lý bởi người riêng. Những dự án như là Wikipedia, Susning.nu và Enciclopedia Libre là wiki, trong đó các bài viết được phát triển bởi nhiều tác giả, và không có quá trình kiểm duyệt bài viết chính thức. Trong những bách khoa toàn thư wiki đó, Wikipedia được trở thành bách khoa lớn nhất tính theo số bài viết và số chữ. Khác với nhiều bách khoa toàn thư, nó cho phép sử dụng nội dung dưới Giấy phép Văn bản Tự do GNU.\nWikipedia có một bộ quy định để lựa chọn loại thông tin nào để bao gồm trong dự án. Nhiều khi những quy định này được chú thích khi bàn cãi về việc cộng thêm, sửa lại, di chuyển, hoặc xóa một bài viết...\n", "Lịch sử\nĐầu tiên thì Wikipedia chỉ là dự án nhỏ bên cạnh Nupedia, dự án để viết bách khoa với một số nhà chuyên môn theo quá trình chính thức. Nupedia mở cửa ngày 9 tháng 3 năm 2000 dưới sở hữu của Tập đoàn Bomis, một công ty cổng Web. Những người chính của dự án là Jimmy Wales, giám đốc của Bomis, và Larry Sanger, chủ bút của Nupedia và Wikipedia sau đó. Ông Sanger nói rằng Nupedia khác với những bách khoa toàn thư đã có vì nó sử dụng nội dung mở; nó không có hạn chế về kích cỡ vì nó chỉ tồn tại trên Internet; và Nupedia không thiên vị vì nó công khai và có thể có nhiều loại người đóng góp[19]. Nupedia có quá trình 7 bước để nhà chuyên môn kiểm tra các bài thuộc chuyên môn của họ, nhưng quá trình này bị xem là quá chậm cho một số bài ít ỏi. Dùng tiền của Bomis, có lúc họ đặt kế hoạch để lấy lại vốn đầu tư bằng quảng cáo[19]. Nó được sử dụng dưới Giấy phép Nội dung mở Nupedia trước tiên, nhưng đổi qua Giấy phép Văn bản Tự do GNU trước khi Wikipedia được thành lập, theo yêu cầu của Richard Stallman.\nTrên danh sách gửi thư của Nupedia, ngày 10 tháng 1 năm 2001, Sanger đề nghị tạo ra wiki bên cạnh Nupedia. Dưới đề tài \"Hãy làm một wiki\" (Let's make a wiki), ông viết rằng:\n\"Không, đây không phải là một đề nghị khiếm nhã. Đây là một ý tưởng để thêm một ít tính năng vào Nupedia. Jimmy Wales nghĩ rằng nhiều người có thể thấy những ý kiến đó thực sự khó chịu, nhưng tôi không nghĩ thế (...) Khi sử dụng Nupedia như một wiki, đây là dự án mở RẤT LỚN với định dạng đơn giản cho việc phát triển nội dung. Chúng tôi đôi khi bàn về ý tưởng về các dự án khác đơn giản hơn để thay thế hoặc bổ sung cho Nupedia.. Đối với tôi, wiki có thể được thực hiện thực tế ngay lập tức, cần được bảo dưỡng rất ít, và nói chung là rất ít rủi ro. Các wiki cũng là một nguồn thông tin cực kì tiềm năng. Như tôi có thể nhận thấy, nó khá ít nhược điểm.\nWikipedia mở cửa chính thức ngày 15 tháng 1 năm 2001, chỉ là một phiên bản tiếng Anh tại wikipedia.com, và ông Sanger giới thiệu nó lần đầu tiên trên danh sách gửi thư[21]. Trước đó, từ ngày 10 tháng 1, nó chỉ là một tính năng của Nupedia, trong đó ai nào có thể viết bài để được thêm vào bách khoa toàn thư sau khi được xem lại. Nó được bắt đầu lại bên ngoài Nupedia, sau khi các nhà chuyên môn của Ủy ban Tư vấn Nupedia phản đối kiểu phát triển của nó[22]. Sau đó, Wikipedia hoạt động như dự án riêng không có Nupedia bảo quản. Quy định \"quan điểm trung lập\" của nó được viết xuống vào những tháng đầu tiên, tuy nó sát với quy định \"nonbias\" (phi thiên vị) của Nupedia. Ngoài đó, chỉ có một vài nguyên tắc đầu tiên. Wikipedia được nhiều người đóng góp đến từ Nupedia, những tin nhắn tại Slashdot, và kết quả tìm kiếm. Nó tăng lên tới 20.000 bài viết bằng 18 ngôn ngữ vào cuối năm đầu[23]. Nupedia và Wikipedia hoạt động bên cạnh nhau đến khi máy chủ Nupedia bị ngừng hoạt động thường trực vào năm 2003, và cả nội dung Nupedia được đưa vào Wikipedia.\nHai ông Wales và Sanger cho rằng WikiWikiWeb của Ward Cunningham hoặc Kho Mẫu Portland đã đưa ra quan niệm sử dụng wiki. Ông Wales nói rằng ông nghe về quan niệm này lần đầu tiên từ Jeremy Rosenfield, một người làm cho Bomis và đã dẫn ông Wales đến wiki đó vào tháng 12 năm 2000[24], nhưng Wikipedia mới bắt đầu sau khi ông Sanger nghe về wiki đó từ Ben Kovitz, người quen ở đấy, vào tháng 1 năm 2001[22] và đề nghị tạo ra wiki cho Nupedia. Dưới quan niệm liên quan đến nội dung tự do, nhưng không dựa trên wiki, dự án GNUPedia hoạt động bên cạnh Nupedia vào đầu lịch sử của nó. Sau đó nó ngừng hoạt động và người thành lập nó, người nổi tiếng về phần mềm tự do Richard Stallman, ủng hộ Wikipedia[25].\nVì sợ có thể mang quảng cáo đến dự án và thiếu quyền hạn bảo quản ở trung tâm phiên bản tiếng Anh, nhiều người dùng Wikipedia tiếng Tây Ban Nha (Wikipedia en español) chia ra khỏi Wikipedia để thành lập Enciclopedia Libre vào tháng 2 năm 2002. Sau đó cùng năm, ông Wales loan báo là Wikipedia sẽ không bao gồm quảng cáo trong tương lai, và website được chuyển sang địa chỉ wikipedia.org. Từ đó, nhiều dự án đã chia ra khỏi Wikipedia vì quy định viết bài, ví dụ như Wikinfo, họ bỏ \"quan điểm trung lập\" để thay với nhiều bài viết phụ nhau viết theo \"quan điểm thông cảm\".\nTừ Wikipedia và Nupedia, Quỹ Hỗ trợ Wikipedia được thành lập ngày 20 tháng 6 năm 2003[26]. Từ đó đến nay, Wikipedia và các dự án liên quan trực thuộc tổ chức bất vụ lợi đó. Dự án liên quan đầu tiên của Wikipedia, \"Kỷ niệm: Wiki 11 tháng 9\", được thành lập vào tháng 10 năm 2002 để kể chuyện về những Tấn công khủng bố ngày 11 tháng 9; dự án từ điển Wiktionary mở cửa vào tháng 12 năm 2002; bộ sưu tập danh ngôn Wikiquote, một tuần sau khi Wikimedia được thành lập; và thư viện mở Wikibooks, tháng sau. Sau đó Wikimedia vẫn tiếp tục bắt đầu thêm dự án khác.\nWikipedia thường đo sự phát triển của dự án theo số bài viết. Trong hai năm đầu tiên, nó tăng lên khoảng chừng vài trăm bài mới mỗi ngày. Wikipedia tiếng Anh đạt tới bài viết thứ 100.000 ngày 22 tháng 1 năm 2003. Năm 2004, tốc độ tăng lên số bài vào khoảng 1.000 hay 3.000 mỗi ngày cho tất cả các phiên bản ngôn ngữ. Wikipedia tiếng Anh đạt tới bài thứ 500.000 ngày 25 tháng 2 năm 2004[27]. Wikipedia đạt đến bài viết thứ một triệu trong tất cả 105 phiên bản ngôn ngữ vào ngày 20 tháng 9 năm 2004[28], trong khi phiên bản tiếng Anh nói riêng đạt đến bài viết thứ 500.000 ngày 18 tháng 3 năm 2005[29] và bài thứ một triệu ngày 1 tháng 3 năm 2006[30].\nQuỹ Hỗ trợ Wikimedia đã đăng ký nhãn hiệu Wikipedia® tại Cơ quan sáng chế và nhãn hiệu Hoa Kỳ ngày 17 tháng 9 năm 2004. Nhãn hiệu này được công nhận chính thức ngày 10 tháng 1 năm 2006. Bản quyền của nhãn hiệu cũng được chấp nhận tại Nhật Bản ngày 16 tháng 12 năm 2004 và tại Liên minh châu Âu ngày 20 tháng 1 năm 2005. Gọi chính xác là dấu hiệu phục vụ, phạm vi của dấu hiệu này bao gồm: \"Sự cung cấp thông tin ở lĩnh vực kiến thức bách khoa tổng quát dùng Internet\".\nHiện có dự định cho phép sử dụng nhãn hiệu Wikipedia để sản phẩm sách vở hoặc DVD[31]. Nguyên cả Wikipedia tiếng Đức sẽ được in ra bởi công ty Directmedia, trong 100 cuốn sách, mỗi cuốn 800 trang. Họ sẽ bắt đầu vào tháng 10 năm 2006 và xong vào năm 2010.\nNgày 27 tháng 2 năm 2006, Wikipedia tiếng Anh đạt tới con số một triệu thành viên, với \"Romulus32\" được coi như thành viên một triệu. Vài ngày sau, ngày 1 tháng 3 năm 2006, phiên bản tiếng Anh cũng đạt tới con số một triệu bài viết. \"Jordanhill railway station\", giải thích về Nhà ga Jordanhill tại Glasgow (Scotland), được định là thứ một triệu.\n", "Phần mềm và máy móc\nWikipedia dựa trên MediaWiki, nền phần mềm wiki chuyên biệt có nguồn tự do và mở, phần lớn được viết trong PHP và được xây trên cơ sở dữ liệu MySQL. Phần mềm này bao gồm những tính năng lập trình như là ngôn ngữ macro, biến số, hệ thống gắn tiêu bản (template transclusion), và đổi hướng URL. MediaWiki được phát hành theo Giấy phép Công cộng GNU (GPL) và được sử dụng bởi các dự án Wikimedia, cũng như nhiều dự án wiki khác. Ban đầu Wikipedia chạy trên UseModWiki, một chương trình Perl của Clifford Adams (Phase I). Nó bắt phải viết hoa theo kiểu CamelCase để tạo ra siêu liên kết giữa các bài; cú pháp hai dấu ngoặc vuông được hỗ trợ về sau. Bắt đầu từ tháng 1 năm 2002 (Phase II), Wikipedia bắt đầu sử dụng chương trình PHP wiki với cơ sở dữ liệu MySQL; phần mềm này được viết đặc biệt cho Wikipedia bởi Magnus Manske. Phần mềm Phase II được sửa nhiều lần để thỏa mãn nhu cầu đang lên theo đường lũy thừa (exponential growth). Tháng 7 năm 2002 (Phase III), Wikipedia đổi qua phần mềm thế hệ thứ ba, MediaWiki, mới đầu do Lee Daniel Crocker viết.\nWikipedia chạy trên các nhóm máy chủ Linux tại Florida và hai vị trí khác.[33] Wikipedia chỉ xài một máy chủ cho đến năm 2004; lúc đó hệ thống máy chủ được mở rộng thành cấu trúc đa tầng (multitier architecture) phân phối. Vào tháng 1 năm 2005, dự án chạy trên 39 máy chủ dành riêng ở Florida. Hình dạng này bao gồm một máy cơ sở dữ liệu chủ chạy MySQL, vài máy phụ CSDL, 21 máy chủ web chạy Apache HTTP Server, và bảy máy bộ nhớ Squid. Vào tháng 9 năm 2005, nhóm máy chủ này đã bao gồm 100 máy tại ba vị trí chung quanh thế giới[33].\nCác yêu cầu trang được gửi cho tầng máy Squid trước. Những yêu cầu mà bộ nhớ Squid không thể thỏa mãn được gửi qua các máy chủ cân bằng tải (load-balancing server) có phần mềm Linux Virtual Server; nó gửi yêu cầu cho một trong những máy chủ Apache để kết xuất trang dùng dữ liệu từ CSDL. Các máy chủ web gửi lại những trang được yêu cầu và kết xuất trang của các phiên bản ngôn ngữ Wikipedia. Để tăng lên tốc độ trả lời nhiều hơn, các trang được kết xuất cho người chưa đăng nhập được bỏ vào bộ nhớ phân phối (distributed memory cache) cho đến khi nó lỗi thời, nên có thể bỏ qua hẳn quá trình kết xuất trang đối với phần nhiều lần truy cập những trang thường gặp. Hai nhóm máy chủ lớn hơn tại Hà Lan và Hàn Quốc hiện xử lý nhiều nhu cầu cho Wikipedia.\n", "Dự án liên quan\nWikipedia có vài dự án liên quan:\nVào tháng 2 năm 2001, phần lớn người dùng Wikipedia bằng tiếng Tây Ban Nha không hài lòng với phương hướng của dự án nên đã rút khỏi để bắt đầu dự án Enciclopedia Libre.[cần dẫn nguồn]\n", "Ghi chú\n", "Tham khảo\n", "Liên kết ngoài\nTrình đơn chuyển hướng"]}